from random import *
from time import sleep


def main():
    global name
    sleep(1)
    print('Ммм.. Опять разбудили!\n')
    sleep(timeout)
    print('''
    ─────────╔╗─╔╗╔═══╗╔╗───╔╗─────────────╔═══╗─────────
    ─────────║║─║║║╔══╝║║───║║─────────────║╔═╗║─────────
    ─────────║╚═╝║║╚══╗║║───║║─────────────║║─║║─────────
    ─────────║╔═╗║║╔══╝║║─╔╗║║─╔╗──────────║║─║║─────────
    ─────────║║─║║║╚══╗║╚═╝║║╚═╝║──────────║╚═╝║─────────
    ─────────╚╝─╚╝╚═══╝╚═══╝╚═══╝──────────╚═══╝─────────\n\n''')
    sleep(timeout)
    print('Что же, добро пожаловать в игру "Числовая угАДайка".\n---')
    sleep(timeout)
    print('Меня зовут Бот-Бегемот!Ха-ха! Хозяин создал меня, чтобы испытывать '
          'искушенные умы.\n---')
    sleep(timeout)
    print('Чтобы узнать правила, введи "Далее":\n>>')
    next = input()
    while next.lower() != 'далее':
        next = input('Еще не поздно отказаться, но если все таки хочешь испытать себя, введи "Далее":\n>>')
    sleep(timeout)
    print('\nИтак, правила игры просты.\n---')
    sleep(timeout)
    print(
        'Твой стартовый игровой баланс: 1000 осколков души. Чтобы пройти испытание, тебе надо выиграть у меня мои '
        '9000 осколков души и не потерять свои осколки.\n---')
    sleep(timeout)
    print('Это будет непросто! Надеюсь ты любишь числа и алгоритмы!\n---')
    sleep(timeout)
    print(
        'Ты должен угадывать загаданные мной числа в определенном диапазоне и за определённое количество попыток, '
        'которые ты можешь выбрать сам.\n---')
    sleep(timeout)
    print(
        "Чем меньше ты выберешь попыток, тем больше осколков можешь выиграть. Но будь осторожен. если проигрываешь - я "
        "забираю твою душ.. гхм, точнее, ставку! Да, ставку!\n---")
    sleep(timeout)
    print('Ты готов начинать? Напиши "Да" или "Готов":\n>>')
    next = input()
    while next.lower() != 'готов' and next.lower() != 'готова' and next.lower() != 'да':
        next = input('Уже не до шуток, чтобы начать игру, произнеси ключ-команду "Да" или "Готов":\n>>')
    sleep(timeout)
    name = input(
        'Сперва, попрошу тебя представиться. Своё имя я уже назвал, а твоего до сих пор не знаю. Это необходимая '
        'процедура в нашем случае:\n>>')
    sleep(timeout)
    print('\n\nРад знакомству,', name.title())
    sleep(timeout)
    print('Да, хозяин предупреждал о твоем визите. Итак, отбросим в сторону все сентименты и ДА НАЧНЕТСЯ ИГРА\n\n\n')
    sleep(timeout)
    game()


def is_bet_good(bet):
    return len(bet) == 3 and 100 <= bet[0] <= balance and bet[0] <= balance_bot and bet[1] in list_coef and bet[
        2] in list_bet


def quantity_trying(bet):
    if bet[2] == 100:
        if bet[1] == 2:
            return 6
        elif bet[1] == 4:
            return 5
        else:
            return 4
    elif bet[2] == 1000:
        if bet[1] == 2:
            return 9
        elif bet[1] == 4:
            return 8
        else:
            return 7
    else:
        if bet[1] == 2:
            return 13
        elif bet[1] == 4:
            return 12
        else:
            return 11


def game():
    global balance
    global balance_bot

    print('Итак, расклад следующий:')
    print('\nТвой баланс:', balance, 'осколков душ')
    if balance > 0:
        print('Мой баланс:', balance_bot, 'осколков душ')
        print('Доступные коэффициенты:')
        print('коэф. 2, при ставке на: [1-100 - 6 попыток] [1-1000 - 9 попыток] [1-10000 - 13 попыток]')
        print('коэф. 4, при ставке на: [1-100 - 5 попыток] [1-1000 - 8 попыток] [1-10000 - 12 попыток]')
        print(
            'УНИКАЛЬНАЯ ВОЗМОЖНОСТЬ: коэф. 10, при ставке на: [1-100 - 4 попыток] [1-1000 - 7 попыток] [1-10000 - 11 '
            'попыток]')

        print(
            'Чтобы сделать ставку, введите через ПРОБЕЛЫ БЕЗ СКОБОК: [Cумма ставки (мин. 100 осколков души)] ['
            'выбранный коэф.] [последнее число диапазона чисел] (к примеру: 500 4 10000)')
        bet = [int(i) for i in input().split()]
        while not is_bet_good(bet):
            bet = [int(i) for i in input(
                'Неправильный формат! Формат должен быть: Сумма(не менее 100) Коэффициент(2, 4, '
                '10) Ограничивающее_Число(100, 1000 или 10000):\n').split()]

        number = randint(1, bet[2])
        trying = quantity_trying(bet)
        balance -= bet[0]
        balance_bot += bet[0]
        print('Я загадал число в диапазоне от 1 до', bet[2], '. Попробуй угадай! У тебя', trying, 'попыток.')

        while True:
            num = int(input())
            trying -= 1
            if trying == 0:
                print('Сожалею, но твои попытки закончились. Ты проиграл свою ставку. Кстати, загадал я число', number)
                break
            elif num > number:
                print('Не верно, попробуй число поменьше. Попробуй ещё разок. У тебя осталось', trying, 'попыток')
            elif num < number:
                print("Нет, моё число больше. Попробуй ещё разок. У тебя осталось", trying, 'попыток')
            elif num == number:
                print('Везёт тебе,', name.title(), '. Выигрыш в', bet[0] * bet[1], 'твой. Всё по честному.')
                balance += bet[0] * bet[1]
                balance_bot -= bet[0] * bet[1]
                break


        next = input('Чтобы продолжить игру, напиши "далее":\n>>')
        while next.lower() != 'далее':
            next = input('Чтобы продолжить, введи "Далее":\n>>')

        game()
    elif balance >= 10000:
        print(
            f'Да ты везунчик {name.title()}! Ты смог одолеть Бота-Бегемота и вернуть свои осколки души.'
            'Что же, давно у меня не было достойного противника. Я теперь свободен...')
    else:
        print(f'Твоя игра окончена, {name.title()}. Очень сожалею, но ты всегда можешь вызвать меня снова...')
        sleep(3)
        print('''
        ______________________¶¶¶
        ___________________¶¶¶¶¶
        __________________¶¶¶¶¶¶
        ________________¶¶¶¶¶¶¶
        _______________¶¶¶¶¶¶¶¶
        _______________¶¶¶¶¶¶¶¶
        ______________¶¶¶¶¶¶¶¶¶¶
        ______________¶¶¶¶¶¶¶¶¶¶
        ______________¶¶¶¶¶¶¶¶¶¶¶______________¶¶¶
        ______________¶¶¶¶¶¶¶¶¶¶¶¶___________¶¶¶¶
        _______¶______¶¶¶¶¶¶¶¶¶¶¶¶¶________¶¶¶¶¶¶
        _______¶¶¶¶____¶¶¶¶¶¶¶¶¶¶¶¶¶______¶¶¶¶¶¶¶
        _______¶¶¶¶¶___¶¶¶¶¶¶¶¶¶¶¶¶¶¶____¶¶¶¶¶¶¶¶
        _______¶¶¶¶¶¶___¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶__¶¶¶¶¶¶¶¶
        _______¶¶¶¶¶¶¶__¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶
        _______¶¶¶¶¶¶¶__¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶
        ______¶¶¶¶¶¶¶¶__¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶
        _____¶¶¶¶¶¶¶¶¶_¶¶¶¶¶¶¶¶¶¶__¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶
        ___¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶___¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶
        __¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶___¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶
        __¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶____¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶
        _¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶_¶¶¶¶¶¶____¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶
        _¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶__¶¶¶______¶¶¶_¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶
        _¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶___¶________¶¶__¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶
        _¶¶¶¶¶¶¶¶¶¶¶¶¶¶_____________¶¶__¶¶¶¶¶¶¶¶¶¶¶¶¶¶
        _¶¶¶¶¶¶¶¶¶¶¶¶¶¶______________¶____¶¶¶¶¶¶¶¶¶¶¶
        __¶¶¶¶¶¶¶¶¶¶¶¶_____________________¶¶¶¶¶¶¶¶¶
        ____¶¶¶¶¶¶¶¶¶¶_____________________¶¶¶¶¶¶¶¶
        ______¶¶¶¶¶¶¶¶_____________________¶¶¶¶¶¶
        _________¶¶¶¶¶¶___________________¶¶¶¶
        _____________¶¶¶¶¶______________¶''')
        sleep(timeout)
        print('''
        ╔════╗╔═══╗     ╔══╗─╔═══╗     ╔═══╗╔═══╗╔═╗─╔╗╔════╗╔══╗╔═╗─╔╗╔╗─╔╗╔═══╗╔═══╗
        ║╔╗╔╗║║╔═╗║     ║╔╗║─║╔══╝     ║╔═╗║║╔═╗║║║╚╗║║║╔╗╔╗║╚╣─╝║║╚╗║║║║─║║║╔══╝╚╗╔╗║
        ╚╝║║╚╝║║─║║     ║╚╝╚╗║╚══╗     ║║─╚╝║║─║║║╔╗╚╝║╚╝║║╚╝─║║─║╔╗╚╝║║║─║║║╚══╗─║║║║
        ──║║──║║─║║     ║╔═╗║║╔══╝     ║║─╔╗║║─║║║║╚╗║║──║║───║║─║║╚╗║║║║─║║║╔══╝─║║║║
        ──║║──║╚═╝║     ║╚═╝║║╚══╗     ║╚═╝║║╚═╝║║║─║║║──║║──╔╣─╗║║─║║║║╚═╝║║╚══╗╔╝╚╝║
        ──╚╝──╚═══╝     ╚═══╝╚═══╝     ╚═══╝╚═══╝╚╝─╚═╝──╚╝──╚══╝╚╝─╚═╝╚═══╝╚═══╝╚═══╝
        ''')
        sleep(5)
        input()


timeout = uniform(1.5, 3.6)
balance = 1000
balance_bot = 9000
list_coef, list_bet = [2, 4, 10], [100, 1000, 10000]
list_try2, list_try4, list_try10 = [6, 9, 13], [5, 8, 12], [4, 7, 11]
main()
